import { Chat } from '../components/chat';
import { IconLink } from '../components/icon-link';
import { SearchForm } from '../components/search-form';
import { ChatCard } from '../components/chat-card';
import { ChatContent } from '../components/chat-content';
import { ChatUser } from '../components/chat-user';
import { Popup } from '../components/popup';
import { Message } from '../components/message';
import { ChatSeparator } from '../components/chat-separator';

const chatPage = new Chat({
  iconLink: new IconLink({
    name: 'Settings',
    href: '/#edit',
    icon: '<svg width=\'16\' height=\'16\' xmlns="http://www.w3.org/2000/svg"'
      + ' viewBox="0 0 24 24">\n'
      + '  <path\n'
      + '    d="m22.2 14.4-1.2-.7a2 2 0 0 1 0-3.5l1.2-.7c1-.6 1.3-1.8.7-2.7l-1-1.'
      + '7c-.6-1-1.8-1.3-2.7-.7l-1.2.7c-1.3.8-3-.2-3-1.7V2a2 2 0 0 0-2-2h-2a2 2 0 0'
      + ' 0-2 2v1.3C9 4.8 7.3 5.8 6 5l-1.2-.6a2 2 0 0 0-2.7.7l-1 1.7c-.5 1-.2 2.2.7'
      + ' 2.8l1.2.7c1.3.7 1.3 2.7 0 3.4l-1.2.7c-1 .6-1.3 1.8-.7 2.7l1 1.7c.6 1 1.8 1'
      + '.3 2.7.7l1.2-.6c1.3-.8 3 .2 3 1.7V22c0 1.1.9 2 2 2h2a2 2 0 0 0 2-2v-1.3c0-1'
      + '.5 1.7-2.5 3-1.7l1.2.7a2 2 0 0 0 2.7-.7l1-1.7c.5-1.1.2-2.3-.7-2.9zM12 16a4 4'
      + ' 0 0 1-4-4c0-2.2 1.8-4 4-4s4 1.8 4 4a4 4 0 0 1-4 4z"/>\n'
      + '</svg>',
  }),
  searchForm: new SearchForm({
    name: 'search',
    placeholder: 'Search',
  }),
  cards: [
    new ChatCard({
      isActive: true,
      image:
        'https://images.unsplash.com/photo-1527980965255-d3b416303d12?ixlib=rb-4.0.3&ixid='
        + 'MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=880&q=80',
      name: 'Test',
      time: '13:37',
      message: '<span>Bold: </span> Test from JS',
      count: 4,
    }),
    new ChatCard({
      name: 'Test',
    }),
  ],
  chatContent: new ChatContent({
    chatUser: new ChatUser({
      image: 'https://images.unsplash.com/photo-1527980965255-d3b416303d12?ixlib=rb-4.0.3'
        + '&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=880&q=80',
      name: 'User',
    }),
    popupMenu: new Popup({
      buttons: [
        {
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" width="22" height="22">\n'
            + '      <path\n'
            + '        d="M10.34.038a10.9 10.9 0 0 0-6.508 2.643A10.955 10.955 0 0 0 .087 9.735c-.'
            + '075.629-.075 1.901 0 2.53a10.945 10.945 0 0 0 2.594 5.903 10.955 10.955 0 0 0 7.054'
            + ' 3.745c.629.075 1.901.075 2.53 0a10.922 10.922 0 0 0 6.393-3.044 10.957 10.957 0 0'
            + ' 0 '
            + '3.255-6.604c.035-.291.057-.783.057-1.265 0-.482-.022-.974-.057-1.265a10.922 10.922 0'
            + ' 0 0-3.044-6.393C16.633 1.043 13.573-.142 10.34.038m2.09 1.554c2.045.35 3.725 1.182'
            + ' 5'
            + '.14 2.546 1.549 1.493 2.48 3.279 2.841 5.45.097.58.097 2.244 0 2.824-.34 2.043-1.187'
            + ' 3.751-2.572 5.184a9.488 9.488 0 0 1-4.657 2.662c-.81.19-1.111.22-2.182.22-.806 0-1.'
            + '089-.013-1.412-.067-1.646-.274-3.005-.846-4.308-1.815-.551-.41-1.466-1.325-1.876-1.8'
            + '76-.969-1.303-1.541-2.662-1.815-4.308-.097-.58-.097-2.244 0-2.824.274-1.646.846-3.00'
            + '5 1.815-4.308.41-.551 1.325-1.466 1.876-1.876 1.331-.99 2.849-1.617 4.418-1.825l.404'
            + '-.054c.284-.039 1.995.01 2.328.067m-2.163 6.291v2.384H5.5v1.466H10.267V16.5h1.466V11'
            + '.733H16.5v-1.466H11.733V5.5h-1.466v2.383"\n'
            + '        fill-rule="evenodd"/>\n'
            + '    </svg>',
          text: 'Добавить пользователя',
        },
        {
          icon:
            '<svg width="22" height="22" xmlns="http://www.w3.org/2000/svg">\n'
            + '      <path\n'
            + '        d="M10.34.038a10.9 10.9 0 0 0-6.508 2.643A10.955 10.955 0 0 0 .087 9.735c-'
            + '.075.629-.075 1.901 0 2.53a10.945 10.945 0 0 0 2.594 5.903 10.955 10.955 0 0 0 '
            + '7.054 '
            + '3.745c.629.075 1.901.075 2.53 0a10.922 10.922 0 0 0 6.393-3.044 10.957 10.957 0 0 0 '
            + '3.255-6.604c.035-.291.057-.783.057-1.265 0-.482-.022-.974-.057-1.265a10.922 10.922 0'
            + ' 0 0-3.044-6.393C16.633 1.043 13.573-.142 10.34.038m2.09 1.554c2.045.35 3.725 1.182 '
            + '5.14 2.546 1.549 1.493 2.48 3.279 2.841 5.45.097.58.097 2.244 0 2.824-.34 2.043-1.1'
            + '87 3.751-2.572 5.184a9.488 9.488 0 0 1-4.657 2.662c-.81.19-1.111.22-2.182.22-.806 0'
            + '-1.089-.013-1.412-.067-1.646-.274-3.005-.846-4.308-1.815-.551-.41-1.466-1.325-1.876'
            + '-1.876-.969-1.303-1.541-2.662-1.815-4.308-.097-.58-.097-2.244 0-2.824.274-1.646.846'
            + '-3.005 1.815-4.308.41-.551 1.325-1.466 1.876-1.876 1.331-.99 2.849-1.617 4.418-1.82'
            + '5l.404-.054c.284-.039 1.995.01 2.328.067m-5.308 5.53-.522.523 1.677 1.677L9.955 11l'
            + '-1.678 1.678L6.6 14.355l.522.523.523.522 1.677-1.677L11 12.045l1.678 1.678 1.677 1.'
            + '677.523-.522.522-.523-1.677-1.677L12.045 11l1.678-1.678L15.4 7.645l-.522-.523-.523-'
            + '.522-1.677 1.677L11 9.955 9.322 8.277 7.645 6.6l-.523.522"\n'
            + '        fill-rule="evenodd"/>\n'
            + '    </svg>',
          text: 'Удалить пользователя',
        },
      ],
    }),
    messages: [
      new ChatSeparator({
        text: '19 july',
      }),
      new Message({
        content:
          'Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в '
          + 'какой-то момент попросила\n'
          + '    Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем '
          + 'что астронавты летали с моделью\n'
          + '    500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности '
          + 'Луны, так как астронавты с\n'
          + '    собой забрали только кассеты с пленкой.\n'
          + '    <br><br>\n'
          + '    Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на'
          + ' ракету они так никогда и не\n'
          + '    попали. Всего их было произведено 25 штук, одну из них недавно продали на'
          + ' аукционе за 45000 евро.',
        time: '13:35',
      }),
      new Message({
        isImage: true,
        content: '<img src="https://www.leitz-auction.com/img/24/3b/15e32ce5c6bf6c38c5b7/-'
          + '37332_1.jpg" alt="Test">',
        time: '13:36',
      }),
      new Message({
        isMy: true,
        content: 'Круто!',
        time: '13:37',
      }),
    ],
    popupAttach: new Popup({
      buttons: [
        {
          icon:
            '<svg width="22" height="22" viewBox="0 0 22 22" xmlns="http://www.w3.org/2000/svg">\n'
            + '      <path fill-rule="evenodd" clip-rule="evenodd"\n'
            + '            d="M4 1.5H18C19.3807 1.5 20.5 2.61929 20.5 4V14L14.5194 12.4052C13'
            + '.5108 12.1362 12.4714 12 11.4275 12H10.5725C9.52864 12 8.48921 12.1362 7.48057 '
            + '12.4052L1.5 14V4C1.5 2.61929 2.61929 1.5 4 1.5ZM0 4C0 1.79086 1.79086 0 4 0H18C'
            + '20.2091 0 22 1.79086 22 4V18C22 20.2091 20.2091 22 18 22H4C1.79086 22 0 20.2091'
            + ' 0 18V4ZM8 6C8 7.10457 7.10457 8 6 8C4.89543 8 4 7.10457 4 6C4 4.89543 4.89543'
            + ' 4 6 4C7.10457 4 8 4.89543 8 6Z"/>\n'
            + '    </svg>',
          text: 'Фото или Видео',
        },
        {
          icon:
            '<svg width="22" height="22" viewBox="0 0 22 22" xmlns="http://www.w3.org/2000/svg">\n'
            + '      <path fill-rule="evenodd" clip-rule="evenodd"\n'
            + '            d="M4 1.5H18C19.3807 1.5 20.5 2.61929 20.5 4V12H16C13.7909 12 12 '
            + '13.7909 12 16V20.5H4C2.61929 20.5 1.5 19.3807 1.5 18V4C1.5 2.61929 2.61929 1.5 4'
            + ' 1.5ZM12 22H4C1.79086 22 0 20.2091 0 18V4C0 1.79086 1.79086 0 4 0H18C20.2091 0 2'
            + '2 1.79086 22 4V12V18C22 20.2091 20.2091 22 18 22H12Z"/>\n'
            + '    </svg>',
          text: 'Файл',
        },
        {
          icon:
            '<svg width="22" height="22" viewBox="0 0 22 22" xmlns="http://www.w3.org/2000/svg">\n'
            + '      <path fill-rule="evenodd" clip-rule="evenodd"\n'
            + '            d="M20.5 11C20.5 16.2467 16.2467 20.5 11 20.5C5.75329 20.5 1.5 16.2467'
            + ' 1.5 11C1.5 5.75329 5.75329 1.5 11 1.5C16.2467 1.5 20.5 5.75329 20.5 11ZM22 11C22 1'
            + '7.0751 17.0751 22 11 22C4.92487 22 0 17.0751 0 11C0 4.92487 4.92487 0 11 0C17.0751 '
            + '0 22 4.92487 22 11ZM11 14C12.6569 14 14 12.6569 14 11C14 9.34315 12.6569 8 11 8C9.'
            + '34315 8 8 9.34315 8 11C8 12.6569 9.34315 14 11 14Z"/>\n'
            + '    </svg>',
          text: 'Локация',
        },
      ],
    }),
  }),
});
export default chatPage;
